CytronTechnologies/CT-ARM/system/Nano100Series/StdDriver/src/rtc.c
}


/**
 *  @brief    This function is used to update date to RTC
 *
 *  @param    u32Year       The Year Calendar Digit of Alarm Setting
 *  @param    u32Month      The Month Calendar Digit of Alarm Setting
 *  @param    u32Day        The Day Calendar Digit of Alarm Setting
 *  @param    u32DayOfWeek  The Day of Week. [RTC_SUNDAY / RTC_MONDAY / RTC_TUESDAY /
 *                                            RTC_WEDNESDAY / RTC_THURSDAY / RTC_FRIDAY /
 *                                            RTC_SATURDAY]
 *
 *  @return   None
 *
 */
void RTC_SetDate(uint32_t u32Year, uint32_t u32Month, uint32_t u32Day, uint32_t u32DayOfWeek)
{
    __IO uint32_t u32Reg;

    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    RTC->DWR = u32DayOfWeek & RTC_DWR_DWR_Msk;

    u32Reg     = ((u32Year - RTC_YEAR2000) / 10) << 20;
    u32Reg    |= (((u32Year - RTC_YEAR2000) % 10) << 16);
    u32Reg    |= ((u32Month  / 10) << 12);
    u32Reg    |= ((u32Month  % 10) << 8);
    u32Reg    |= ((u32Day    / 10) << 4);
    u32Reg    |=  (u32Day    % 10);
    g_u32Reg   = u32Reg;

    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    RTC->CLR = (uint32_t)g_u32Reg;

}

/**
 *  @brief    This function is used to update time to RTC.
 *
 *  @param    u32Hour     The Hour Time Digit of Alarm Setting.
 *  @param    u32Minute   The Minute Time Digit of Alarm Setting
 *  @param    u32Second   The Second Time Digit of Alarm Setting
 *  @param    u32TimeMode The 24-Hour / 12-Hour Time Scale Selection. [RTC_CLOCK_12 / RTC_CLOCK_24]
 *  @param    u32AmPm     12-hour time scale with AM and PM indication. Only Time Scale select 12-hour used. [RTC_AM / RTC_PM]
 *
 *  @return   None
 *
 */
void RTC_SetTime(uint32_t u32Hour, uint32_t u32Minute, uint32_t u32Second, uint32_t u32TimeMode, uint32_t u32AmPm)
{
    __IO uint32_t u32Reg;

    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    if (u32TimeMode == RTC_CLOCK_12) {
        RTC->TSSR &= ~RTC_TSSR_24H_12H_Msk;

        if (u32AmPm == RTC_PM)    /* important, range of 12-hour PM mode is 21 upto 32 */
            u32Hour += 20;
    } else if(u32TimeMode == RTC_CLOCK_24) {
        RTC->TSSR |= RTC_TSSR_24H_12H_Msk;
    }

    u32Reg     = ((u32Hour   / 10) << 20);
    u32Reg    |= ((u32Hour   % 10) << 16);
    u32Reg    |= ((u32Minute / 10) << 12);
    u32Reg    |= ((u32Minute % 10) << 8);
    u32Reg    |= ((u32Second / 10) << 4);
    u32Reg    |=  (u32Second % 10);

    g_u32Reg = u32Reg;

    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    RTC->TLR = (uint32_t)g_u32Reg;

}

/**
 *  @brief    This function is used to set alarm date to RTC
 *
 *  @param    u32Year    The Year Calendar Digit of Alarm Setting
 *  @param    u32Month   The Month Calendar Digit of Alarm Setting
 *  @param    u32Day     The Day Calendar Digit of Alarm Setting
 *
 *  @return   None
 *
 */
void RTC_SetAlarmDate(uint32_t u32Year, uint32_t u32Month, uint32_t u32Day)
{
    __IO uint32_t u32Reg;

    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    u32Reg       = ((u32Year - RTC_YEAR2000) / 10) << 20;
    u32Reg      |= (((u32Year - RTC_YEAR2000) % 10) << 16);
    u32Reg      |= ((u32Month  / 10) << 12);
    u32Reg      |= ((u32Month  % 10) << 8);
    u32Reg      |= ((u32Day    / 10) << 4);
    u32Reg      |=  (u32Day    % 10);
    g_u32Reg   = u32Reg;

    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    RTC->CAR = (uint32_t)g_u32Reg;

}

/**
 *  @brief    This function is used to set alarm date to RTC
 *
 *  @param     u32Hour     The Hour Time Digit of Alarm Setting.
 *  @param     u32Minute   The Month Calendar Digit of Alarm Setting
 *  @param     u32Second   The Day Calendar Digit of Alarm Setting
 *  @param     u32TimeMode The 24-Hour / 12-Hour Time Scale Selection. [RTC_CLOCK_12 / RTC_CLOCK_24]
 *  @param     u32AmPm     12-hour time scale with AM and PM indication. Only Time Scale select 12-hour used. [RTC_AM / RTC_PM]
 *
 *  @return   None
 *
 */
void RTC_SetAlarmTime(uint32_t u32Hour, uint32_t u32Minute, uint32_t u32Second, uint32_t u32TimeMode, uint32_t u32AmPm)
{
    __IO uint32_t u32Reg;

    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    if (u32TimeMode == RTC_CLOCK_12) {
        RTC->TSSR &= ~RTC_TSSR_24H_12H_Msk;

        if (u32AmPm == RTC_PM)    /* important, range of 12-hour PM mode is 21 upto 32 */
            u32Hour += 20;
    } else if(u32TimeMode == RTC_CLOCK_24) {
        RTC->TSSR |= RTC_TSSR_24H_12H_Msk;
    }

    u32Reg     = ((u32Hour   / 10) << 20);
    u32Reg    |= ((u32Hour   % 10) << 16);
    u32Reg    |= ((u32Minute / 10) << 12);
    u32Reg    |= ((u32Minute % 10) <<  8);
    u32Reg    |= ((u32Second / 10) <<  4);
    u32Reg    |=  (u32Second % 10);

    g_u32Reg = u32Reg;

    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    RTC->TAR = (uint32_t)g_u32Reg;

}


/**
 *  @brief    This function is used to:                       \n
 *            1. Enable tamper detection function.            \n
 *            2. Set tamper control register, interrupt.      \n
 *
 *  @param    u32PinCondition set tamper detection condition: 1=Falling detect, 0=Rising detect
 *
 *  @return   None
 *
 */
void RTC_EnableTamperDetection(uint32_t u32PinCondition)
{
    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    /* detection edge select */
    if(u32PinCondition)
        RTC->SPRCTL |= RTC_SPRCTL_SNOOPEDGE_Msk;
    else
        RTC->SPRCTL &= ~RTC_SPRCTL_SNOOPEDGE_Msk;

    /* enable snooper pin event detection */
    RTC->SPRCTL |= RTC_SPRCTL_SNOOPEN_Msk;
}

/**
 *  @brief    This function is used to disable tamper detection function.
 *
 *  @param    None
 *
 *  @return   None
 *
 */
void RTC_DisableTamperDetection(void)
{
    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    RTC->SPRCTL &= ~RTC_SPRCTL_SNOOPEN_Msk;
}

uint32_t RTC_GetDayOfWeek(void)
{
    return (RTC->DWR & RTC_DWR_DWR_Msk);
}


/**
 *  @brief    The function is used to set time tick period for periodic time tick Interrupt.
 *
 *  @param    u32TickSelection
 *                       It is used to set the RTC time tick period for Periodic Time Tick Interrupt request.
 *                       It consists of: \n
 *                       RTC_TICK_1_SEC: Time tick is 1 second        \n
 *                       RTC_TICK_1_2_SEC: Time tick is 1/2 second    \n
 *                       RTC_TICK_1_4_SEC: Time tick is 1/4 second    \n
 *                       RTC_TICK_1_8_SEC: Time tick is 1/8 second    \n
 *                       RTC_TICK_1_16_SEC: Time tick is 1/16 second  \n
 *                       RTC_TICK_1_32_SEC: Time tick is 1/32 second  \n
 *                       RTC_TICK_1_64_SEC: Time tick is 1/64 second  \n
 *                       RTC_TICK_1_128_SEC: Time tick is 1/128 second
 *
 *  @return   None
 *
 */
void RTC_SetTickPeriod(uint32_t u32TickSelection)
{
    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    RTC->TTR = RTC->TTR & ~RTC_TTR_TTR_Msk | u32TickSelection;
}

/**
 *  @brief    The function is used to enable specified interrupt.
 *
 *  @param    u32IntFlagMask      The structure of interrupt source. It consists of: \n
 *                                RTC_RIER_AIER_Msk: Alarm interrupt                  \n
 *                                RTC_RIER_TIER_Msk: Tick interrupt                    \n
 *                                RTC_RIER_SNOOPIER_Msk: Snooper Pin Event Detection Interrupt\n
 *
 *  @return   None
 *
 */
void RTC_EnableInt(uint32_t u32IntFlagMask)
{
    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    RTC->RIER |= u32IntFlagMask;
}

/**
 *  @brief    The function is used to disable specified interrupt.
 *
 *  @param    u32IntFlagMask      The structure of interrupt source. It consists of: \n
 *                                RTC_RIER_AIER_Msk: Alarm interrupt                  \n
 *                                RTC_RIER_TIER_Msk: Tick interrupt                    \n
 *                                RTC_RIER_SNOOPIER_Msk: Snooper Pin Event Detection Interrupt\n
 *
 *  @return  None
 *
 */
void RTC_DisableInt(uint32_t u32IntFlagMask)
{
    RTC->AER = RTC_WRITE_KEY;
    while(!(RTC->AER & RTC_AER_ENF_Msk));

    if(u32IntFlagMask & RTC_RIER_TIER_Msk) {
        RTC->RIER &= ~RTC_RIER_TIER_Msk;
        RTC->RIIR = RTC_RIIR_TIF_Msk;
    }

    if(u32IntFlagMask & RTC_RIER_AIER_Msk) {
        RTC->RIER &= ~RTC_RIER_AIER_Msk;
        RTC->RIIR = RTC_RIIR_AIF_Msk;
    }

    if(u32IntFlagMask & RTC_RIER_SNOOPIER_Msk) {
        RTC->RIER &= ~RTC_RIER_SNOOPIER_Msk;
        RTC->RIIR = RTC_RIER_SNOOPIER_Msk;
    }
}

/**
 *  @brief    Disable RTC clock.
 *
 *  @return   None
 *
 */
void RTC_Close (void)
{
    CLK->APBCLK  &= ~CLK_APBCLK_RTC_EN_Msk;
}


/*@}*/ /* end of group NANO100_RTC_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NANO100_RTC_Driver */

/*@}*/ /* end of group NANO100_Device_Driver */

/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/


